[
    {
        "title": "Forbes is shutting down its investing app — consider these 8 alternative automated investing apps",
        "description": "Forbes is shutting down its AI-powered investment app in December. Here are 8 alternative AI-powered apps and robo-advisors. Start investing today.",
        "url": "https://www.businessinsider.com/personal-finance/forbes-shutting-down-investing-app-alternative-apps-2023-11"
    },
    {
        "title": "Why ESG Is A Top Priority Of CFOs",
        "description": "The published version of Forbes' CFO newsletter delivers the latest news for chief financial officers and other budget-focused leaders to inboxes every Tuesday.",
        "url": "https://www.forbes.com/sites/meganpoinski/2023/11/14/why-esg-is-a-top-priority-of-cfos/"
    },
    {
        "title": "What The SEC’s SolarWinds Charges Mean For CFOs And Their Peers—8 Steps To Forge A Chain Of Accountability",
        "description": "The SEC’s charges against SolarWinds and its CISO are a game-changer, signaling the SEC espouses a broader view of accountability extending beyond the CEO and CFO to the rest of the C-suite.",
        "url": "https://www.forbes.com/sites/jimdeloach/2023/11/13/what-the-secs-solarwinds-charges-mean-for-cfos-and-their-peers-8-steps-to-forge-a-chain-of-accountability/"
    },
    {
        "title": "Banks, Insurers May Escape EU’s Toughest ESG Regulation So Far",
        "description": "Banks, asset managers and other financial firms have won a reprieve from Europe’s most consequential ESG regulation to date, as a wave of intense industry lobbying pays off. Spain, which holds the European Union’s rotating presidency, has proposed that financ…",
        "url": "https://www.insurancejournal.com/news/international/2023/11/14/748016.htm"
    },
    {
        "title": "Temenos to Work with MAS to Advance Sustainable Finance",
        "description": "Collaboration with Gprnt on technology solutions powering the future of sustainable finance Collaboration with Gprnt on technology solutions powering the future of sustainable finance",
        "url": "https://www.globenewswire.com/news-release/2023/11/16/2781590/0/en/Temenos-to-Work-with-MAS-to-Advance-Sustainable-Finance.html"
    }
]