[
    {
        "title": "Is the ESG Craze Really Fading?",
        "description": "Most people don’t know that it is the editors, not the writers, who craft headlines. This should be common knowledge among media consumers (but it’s not). Perhaps this is why well-written articles are often skewed or even undone by clickbait headlines. Case i…",
        "url": "https://ritholtz.com/2023/11/esg-craze/"
    },
    {
        "title": "14 Ways AI Can Help Business And Industry Boost Sustainability",
        "description": "Business leaders are starting to think about ways AI can help them with a critical consideration for organizations of all stripes: reducing their carbon footprint.",
        "url": "https://www.forbes.com/sites/forbestechcouncil/2023/11/22/14-ways-ai-can-help-business-and-industry-boost-sustainability/"
    },
    {
        "title": "Using lasers to create a database of the world’s forests",
        "description": "One company is using the technology of LiDAR to change how we map and interact with our forest\nThe post Using lasers to create a database of the world’s forests appeared first on Springwise.",
        "url": "https://www.springwise.com/innovation/sustainability/using-lasers-to-create-a-database-of-the-worlds-forests/"
    },
    {
        "title": "How The Four R's And Three D's Can Shape The Future Of Finance",
        "description": "As the market trends continue to evolve at a rapid pace driven by the four R's, we will witness an industry response embracing three key pillars.",
        "url": "https://www.forbes.com/sites/forbestechcouncil/2023/11/21/how-the-four-rs-and-three-ds-can-shape-the-future-of-finance/"
    },
    {
        "title": "Securing A Healthy Future: Leaders’ Sustainability Priorities For 2024",
        "description": "What is happening on ESG in the real world of business? Well-known leaders in the health sector outline their sustainability priorities for the coming 12 months.",
        "url": "https://www.forbes.com/sites/sallypercy/2023/11/24/securing-a-healthy-future-leaders-sustainability-priorities-for-2024/"
    }
]